
export default [
    {
        version : "3.0.9",
        date : "2025-03-28",
        log : [
            {
                tips : "基础版仿抖音组件上线",
                links : [
                    '/dzs-douyin'
                ]
            },
            {
                tips : "新增文章列表组件",
                links : [
                    '/dzs-article-item'
                ]
            },
            {
                tips : "新增按钮组件",
                links : [
                    '/dzs-button'
                ]
            },
            "后台四件套/表单组件/表单搜索组件更换按钮组件",
            "新版深度复制更新了,对正则表达式/时间复制进行了修复"
        ]
    },
    {
        version : "3.0.8",
        date : "2025-02-24",
        log : [
            {
                tips : "表格组件 新增 operationWidth 控制操作栏的宽度",
                links : [
                    '/dzs-table#参数说明'
                ]
            },
            "修复 表单组件、表格组件、表单搜索组件 对正则表达式和时间处理失败的bug",
            {
                tips : "新增 postman 组件 可以直接进行 请求 目前只支持 query 和 json参数",
                links : [
                    '/postman'
                ]
            },
        ]
    },
    {
        version : "3.0.7",
        date : "2025-02-13",
        log : [
            "支持移动端展示啦",
        ]
    },
    {
        version : "3.0.6",
        date : "2025-02-12",
        log : [
            "表单组件新增可以复制原生组件的值",
            "表单组件修复当type为number时，一直赋值失败的bug",
            "新增目录 可以点击目录直接跳转 也可以直接分享"
        ]
    },
    {
        version : "3.0.5",
        date : "2024-12-24",
        log : [
            "头部表单组件新增 slot 插槽",
            "表单组件新增 slot 默认插槽 form-header 具名插槽",
            "上传文件/图片组件 新增 uploadFun 属性 可以自定义上传方法",
            "修复日期转农历 农历年跨年不对的bug"
        ]
    },
    {
        version : "3.0.4",
        date : "2024-10-31",
        log : [
            "修复表单组件在v-model下 有更多值不会携带出来的bug",
        ]
    },
    {
        version : "3.0.3",
        date : "2024-10-16",
        log : [
            "修复表单组件在v-model小概率赋值失败的bug",
            "优化表单组件/表单组件的参数提示",
            "修复表单组织某些情况下下拉框、多选框、单选框value值相同时报key不是唯一值的bug"
        ]
    },
    {
        version : "3.0.2",
        date : "2024-09-10",
        log : [
            "修复搜索表单组件/表单组件在v-model多层级(xx.xx.xx)赋值失败的bug",
            "参数提示表格对参数类型进行了优化处理"
        ]
    },
    {
        version : "3.0.1",
        date : "2024-08-12",
        log : [
            "修复搜索表单组件/表单组件没填写props报错的bug",
            "修复代码编辑器不能输入的bug",
            "新增后台代码四件套 地址 /four-sets",
            "优化了 富文本编辑器 在后端插入sql时单引号出现的bug"
        ]
    },
    {
        version : "3.0.0",
        date : "2024-08-06",
        log : [
            "全新版本上线了",
            "新增代码编辑器组件",
            "新增文件上传组件、图片上传组件",
            "文档预览新增ppt、txt",
            "删除了拖动示例",
            "搜索更改了 请用ctrl+k进行搜索",
            "优化了暂开指令 修复了部分失效的bug",
            "修复了部分bug"
        ]
    },
]